In [1]:
#Group by on Data Frames
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
#Let's make a dframe
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})

#Show
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.711924 -0.032699
1  X   beta -0.819620 -0.361691
2  Y  alpha  1.224565  0.701277
3  Y   beta  0.943424  1.112058
4  Z  alpha -1.385856 -0.145576

In [5]:
#Now let's see how to use groupby

#Lets grab the dataset1 column and group it by the k1 key
group1 = dframe['dataset1'].groupby(dframe['k1'])

#Show the groupby object
group1

In [6]:
#Now we can perform operations on this particular group
group1.mean()

k1
X   -0.765772
Y    1.083994
Z   -1.385856
Name: dataset1, dtype: float64

In [7]:
# We can use group keys that are series as well

#For example:

#We'll make some arrays for use as keys
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

#Now using the data from dataset1, group the means by city and month
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.819620
    JAN    1.224565
NY  FEB    0.943424
    JAN   -1.048890
Name: dataset1, dtype: float64

In [8]:
# let's see the original dframe again.
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.711924 -0.032699
1  X   beta -0.819620 -0.361691
2  Y  alpha  1.224565  0.701277
3  Y   beta  0.943424  1.112058
4  Z  alpha -1.385856 -0.145576

In [9]:
# WE can also pass column names as group keys
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.765772 -0.197195
Y   1.083994  0.906667
Z  -1.385856 -0.145576

In [10]:
# Or multiple column names
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.711924 -0.032699
   beta  -0.819620 -0.361691
Y  alpha  1.224565  0.701277
   beta   0.943424  1.112058
Z  alpha -1.385856 -0.145576

In [11]:
# Another useful groupby method is getting the group sizes
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [28]:
# We can also iterate over groups

#For example:
for name,group in dframe.groupby('k1'):
    print ('This is the %s group' %name)
    print (group)
    print ('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -0.711924 -0.032699
1  X   beta -0.819620 -0.361691


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  1.224565  0.701277
3  Y   beta  0.943424  1.112058


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -1.385856 -0.145576

In [29]:
# We can also iterate with multiple keys
for (k1,k2) , group in dframe.groupby(['k1','k2']):
    print ("Key1 = %s Key2 = %s" %(k1,k2))
    print (group)
    print ('\n')

Key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha -0.711924 -0.032699


Key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta  -0.81962 -0.361691


Key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha  1.224565  0.701277


Key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta  0.943424  1.112058


Key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -1.385856 -0.145576

In [30]:
# A possibly useful tactic is creating a dictionary of the data pieces 
group_dict = dict(list(dframe.groupby('k1')))

#Show the group with X
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -0.711924 -0.032699
1  X   beta -0.819620 -0.361691

In [31]:
# We could have also chosen to do this with axis = 1

# Let's creat a dictionary for dtypes of objects!
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

#show
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.711924 -0.032699
 1 -0.819620 -0.361691
 2  1.224565  0.701277
 3  0.943424  1.112058
 4 -1.385856 -0.145576,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [33]:
# Next we'll learn how to use groupby with columns

# For example if we only wanted to group the dataset2 column with both sets of keys
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.032699
   beta  -0.361691
Y  alpha  0.701277
   beta   1.112058
Z  alpha -0.145576

In [ ]:
#Next we'll have a quick lesson on grouping with dictionaries and series!